Tekla Open API Reference for Tekla Structures 2025
BasePoint Properties
The BasePoint type exposes the following members.
Properties
Name | Description
AngleToNorth
 Gets or sets the angle to north in radians.
CoordinateSystem
 Gets or sets the coordinate system.
Description
 Gets or sets the description.
EastWest
 Gets or sets the east-west.
Elevation
 Gets or sets the elevation.
Guid
 Gets or sets the guid.
Id
 Gets or sets the id.
InitialGuid
 Gets or sets the initial guid. A metadata field to store for example some external applications base point guid. Not used in itself in any functionality.
IsCurrentBasePoint
 Gets or sets the value indicating if this base point is the current base point.
IsLocked
 Gets or sets the value indicating if this base point is locked.
IsProjectBasePoint
 Gets or sets the value indicating if this base point is the project base point.
IsScopedCurrentBasePoint
 Gets the value indicating whether this base point is the scoped current base point. That means, a temporary base point set with the SetAsCurrent method, and changed back when returned token is disposed of.
Latitude
 Gets or sets the latitude.
LocationInModelX
 Gets or sets the location in model x.
LocationInModelY
 Gets or sets the location in model y.
LocationInModelZ
 Gets or sets the location in model z.
Longitude
 Gets or sets the longitude.
Name
 Gets or sets the name.
NorthSouth
 Gets or sets the north-south.
Top
See Also
Reference
BasePoint Class
Tekla.Structures.Model Namespace